app/views/users/show.html.erb

  <tbody>
    <% @user.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."user_id" = ?  [["user_id", 3]]