app/views/welcome/index.html.erb


	<% if Subject.count.zero? %>
---
SELECT COUNT(*) FROM "subjects"

			<% @subject.name = subject%>
			<% @subject.save %>
---
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Arabic"], ["created_at", "2017-06-27 22:31:27.451518"], ["updated_at", "2017-06-27 22:31:27.451518"]]