app/views/subjects/show.html.erb

SELECT "posts".* FROM "posts"  WHERE "posts"."subject_id" = ?  [["subject_id", 1]]
---
  <tbody>
    <% @subject.posts.each do |post| %>