app/controllers/posts_controller.rb

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @post = Post.new
    @post.subject = Subject.find(params[:subject_id])

SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("title", "body", "subject_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Tutoring for $20"], ["body", "hi title says it all"], ["subject_id", 2], ["user_id", 1], ["created_at", "2017-06-28 04:29:22.150951"], ["updated_at", "2017-06-28 04:29:22.150951"]]
---
  def create
    @post = Post.new(post_params)
    @post.subject = Subject.find(params[:subject_id])
    @post.user = current_user


    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 4  [["body", "asdfdsfasadf"], ["title", "sdfsadfsdfsd"], ["updated_at", "2017-04-27 15:21:59.858602"]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)