app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    @reviews = Review.all

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def new
    @review = Review.new
    @review.user = User.find(params[:user_id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("author", "body", "created_at", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Jeremy"], ["body", "asdfsa"], ["created_at", "2017-04-26 23:26:40.302218"], ["rating", 1], ["updated_at", "2017-04-26 23:26:40.302218"], ["user_id", 2]]
---
  def create
    @review = Review.new(review_params)
    @review.user = User.find(params[:user_id])
    @review.author = current_user.name

    respond_to do |format|
      if @review.save

UPDATE "reviews" SET "body" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["body", "sdfdfsadf"], ["rating", 3], ["updated_at", "2017-04-27 15:33:23.961725"]]
---
  def update
    respond_to do |format|
      if @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review.destroy

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_review
      @review = Review.find(params[:id])