app/controllers/users_controller.rb

INSERT INTO "users" ("bio", "category", "created_at", "email", "name", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)  [["bio", "asdf"], ["category", "Tutor"], ["created_at", "2017-04-26 02:46:14.354920"], ["email", "asdf"], ["name", "Jeremy"], ["updated_at", "2017-04-26 02:46:14.354920"], ["year", "Seniro"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "Jeremy Hann"], ["password_hash", "$2a$10$dbPOMgTtnlMz5nyawvC3Lud7RoAD0q7rWLzNuEmGR7E6XZV35zE3y"], ["updated_at", "2017-04-28 04:18:56.964993"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)